/***********************************************************\
 * © 1993 Adobe Systems Incorporated. All rights reserved. *
 *                                                         *
 *   Core Flash Player localizable strings                 *
\***********************************************************/

/////////////////////////////////////////////////////////////
// BLOCK 1: User Interface strings                         //
/////////////////////////////////////////////////////////////

// Shared strings
"GenericDialog_Header"						= "Adobe Flash Player %@";

// Local security dialog
"LocalSecurity_Title"						= "Säkerhet i Adobe Flash Player";
"LocalSecurity_Line1"						= "Adobe® Flash® Player har stoppat en potentiellt osäker åtgärd. Följande lokala program på datorn eller i nätverket:";
"LocalSecurity_Line2"						= "försöker kommunicera med denna Internetaktiverade plats:";
"LocalSecurity_Line3"						= "Om du vill att programmet ska kunna kommunicera med Internet klickar du på Inställningar. Du måste starta om programmet efter att du har ändrat inställningarna.";

"LocalSecurity_SettingsBtn"					= "Inställningar…";
"LocalSecurity_OKBtn"						= "OK";

// Flash Exception dialog
"ActionScriptErrorLabel"					= "Ett ActionScript-fel har uppstått:";
"ExceptionDialog_DismissAllButton"			= "Ignorera alla";
"ExceptionDialog_ContinueButton"			= "Fortsätt";

// Script taking too long dialog
"StuckScript_Message"						= "Ett skript i filmen gör att Adobe® Flash® Player körs långsamt.  Datorn kanske slutar att svara om du fortsätter att köra det.\n\nVill du avbryta skriptet?";
"StuckScript_YesBtn"						= "Ja";
"StuckScript_NoBtn"							= "Nej";

// Debug or profile connection failed dialog
"DebugFailed_Header"						= "Adobe® Flash® Player";
"DebugFailed_Message"						= "Adobe Flash Player kunde inte upprätta en anslutning till felsökningen eller profileringen.";

// Debugger connection dialog
"ShowDialogAtLaunchText"					= "Visa den här dialogrutan vid start";
"ConnectToDebuggerText"						= "Anslut till felsökning";
"DebuggerLocationText"						= "Mitt felsökningsprogram eller värdprogram körs:";
"LocationLocalText"							= "På den här datorn (lokal värd)";
"LocationRemoteText"						= "På IP-adress:";
"ContinueButtonTitle"						= "Fortsätt";

// Can't find preference pane alert
"CantFindPrefPane_Title"					= "Unable to Load Flash Player Preferences Pane";
"CantFindPrefPane_Message"					= "To access your global settings, re-install Adobe Flash Player. It can be downloaded from http://www.adobe.com/go/getflashplayer";

// ----------------------------------------------------------
"IDS_FILE_CHOOSER_TITLE"					= "Välj filer";
"IDS_DIR_CHOOSER_TITLE"						= "Välj mapp";
"IDS_CHOOSER_SELECT_BUTTON"					= "Välj";

// ----------------------------------------------------------
"IDS_FILE_UPLOAD_CHOOSER"					= "Välj vilken fil som ska överföras av ";
"IDS_FILE_UPLOAD_CHOOSER_MULTI_SELECT"		= "Välj vilka filer som ska överföras av ";
"IDS_FILE_DOWNLOAD_SAVE"					= "Välj plats för hämtning av ";
"IDS_DOWNLOAD_FILE_SAVE_CLASSIC_PLUGIN"		= "Välj plats för hämtning";
"IDS_FILE_LOCAL_SAVE"						= "Välj den fil som ska sparas";

// ----------------------------------------------------------

/////////////////////////////////////////////////////////////
// BLOCK 2: Error strings                                  //
/////////////////////////////////////////////////////////////

"IDS_CONSOLE_CASE"							= "-- Troligen fel kombination av stora och små bokstäver.";
"IDS_CONSOLE_SANDBOX"						= "*** Säkerhetssandlådeöverträdelse ***";
"IDS_CONSOLE_NOT_PERMITTED"					= "Anslutningen till %s har stoppats - ej tillåtet från %s";
"IDS_CONSOLE_TITLE"							= "Felsökningskonsolen i Flash Player";
"IDS_CONSOLE_FSCOMMAND_HALTED"				= "FSCommand har stoppats (AllowScriptAccess är %s): %s";
"IDS_CONSOLE_URL_HALTED"					= "Skript-URL har stoppats (AllowScriptAccess är %s): %s";
"IDS_CONSOLE_SECURITY_CONTEXT"				= "SecurityDomain %s försökte få åtkomst till kontexten %s som är inkompatibel";
"IDS_CONSOLE_SECURITY_NULL"					= "SecurityDomain %s försökte få åtkomst till NULL-kontext";
"IDS_CONSOLE_SECURITY_PLAYER"				= "SecurityDomain %s försökte få åtkomst till Players användargränssnittskontext";
"IDS_CONSOLE_WARN_NO_PROP"					= "Varning: \'%s har ingen %s-egenskap";
"IDS_CONSOLE_WARN_NOT_A_FUNC"				= "Varning: %s är inte en funktion";
"IDS_CONSOLE_WARN_NOT_DEFINED"				= "Varning: %s har inte definierats";
"IDS_CONSOLE_WARN_400"						= "Varning: 400 - Ogiltig begäran: %s";
"IDS_CONSOLE_WARN_401"						= "Varning: 401 - Obehörig: %s";
"IDS_CONSOLE_WARN_402"						= "Varning: 402 - Betalning krävs: %s";
"IDS_CONSOLE_WARN_403"						= "Varning: 403 - Otillåten: %s";
"IDS_CONSOLE_WARN_404"						= "Varning: 404 - Hittades inte: %s";
"IDS_CONSOLE_WARN_405"						= "Varning: 405 - Metoden är inte tillåten, felaktig MIME-typ: %s";
"IDS_CONSOLE_WARN_406"						= "Varning: 406 - Godkänns inte: %s";
"IDS_CONSOLE_WARN_500"						= "Varning: 500 - Serverfel: %s";
"IDS_CONSOLE_WARN_501"						= "Varning: 501 - Har inte implementerats: %s";
"IDS_CONSOLE_WARN_502"						= "Varning: 502 - Felaktig gateway: %s";
"IDS_CONSOLE_WARN_503"						= "Varning: 503 - Slut på resurser: %s";
"IDS_CONSOLE_WARN_504"						= "Varning: 504 - Tidsgräns för gateway: %s";
"IDS_CONSOLE_WARN_505"						= "Varning: 505 - HTTP-versionen stöds inte: %s";
"IDS_CONSOLE_WARN_NO_CONNECT"				= "Varning: Det gick inte att ansluta, %s";
"IDS_CONSOLE_WARN_FAIL_ALLOCATE_URL"		= "Varning: Det gick inte att allokera URL-sökvägen";
"IDS_CONSOLE_WARN_CORRUPT_DATA"				= "Varning: Det gick inte att tolka skadade data.";
"IDS_CONSOLE_WARN_FAIL_PLACE"				= "Varning: Det gick inte att placera objektet på djupet %d.";
"IDS_CONSOLE_WARN_FAIL_PLACE_MISSING_CHAR" 	= "Varning: Det gick inte att placera objektet: tecken saknas";
"IDS_CONSOLE_WARN_FTP_FILE"					= "Varning: FTP-filöppningsfel, %s";
"IDS_CONSOLE_WARN_HTTP_REQUEST"				= "Varning: Fel i HTTP-öppningsbegäran, %s";
"IDS_CONSOLE_WARN_HTTP_QUERY"				= "Varning: HTTP-frågeinformationsfel, %s";
"IDS_CONSOLE_WARN_HTTP_SEND"				= "Varning: Fel i HTTP-sändningsbegäran, %d: %s";
"IDS_CONSOLE_WARN_NET_CONNECT"				= "Varning: Internetanslutningsfel, %s";
"IDS_CONSOLE_WARN_NET_OPEN"					= "Varning: Internetöppningsfel";
"IDS_CONSOLE_WARN_UNKNOWN_DOWNLOAD_TYPE"	= "Varning: Okänd Player-hämtningstyp, %s";
"IDS_CONSOLE_WARN_BAD_PORT"					= "Varning: Porten %d ligger utanför tillåtet intervall.";
"IDS_CONSOLE_WARN_WARNING_LIMIT"			= "Varning: Varningsgränsen %d har nåtts";
"IDS_CONSOLE_WARN_UNDECLARED_PROP"			= "Varning: Referens till en egenskap som inte har deklarerats, %s";
"IDS_CONSOLE_WARN_UNDECLARED_VAR"			= "Varning: Referens till en variabel som inte har deklarerats, %s";
"IDS_CONSOLE_WARN_SOCKET_ERROR"				= "Varning: Socketfel, %s";
"IDS_CONSOLE_WARN_STACK"					= "Varning: Spill i stacken (toppning)";
"IDS_CONSOLE_WARN_HOST"						= "Varning: Det går inte att lösa värden: %s";
"IDS_CONSOLE_WARN_GENERIC_HOST"				= "Varning: Det går inte att lösa värden";
"IDS_CONSOLE_WARN_EXCEPTION"				= "Varning: Undantagsfel utan felhantering, %s";
"IDS_CONSOLE_WARN_HTTP_STATUS"				= "Varning: Okänd HTTP-status %d: %s";
"IDS_CONSOLE_WARN_NO_URL"					= "Varning: Ingen URL-sökväg";
"IDS_CONSOLE_SECURITY_DIALOG"				= "Äldre domänmatchning har påträffats - %s försöker få åtkomst till %s";
"IDS_CONSOLE_LOCAL_OUTBOUND"				= "-- Otillförlitliga SWF-filer kan inte kontakta Internet.";
"IDS_CONSOLE_LOCAL_INBOUND"					= "-- Fjärranslutna SWF-filer kan inte få åtkomst till lokala filer.";
"IDS_CONSOLE_WARN_AVM1_LOADED_AVM2"			= "Varning: En ActionScript 1.0/2.0 SWF-fil har läst in en ActionScript 3.0 SWF-fil; koden i ActionScript 3.0 SWF kommer inte att köras.";
"IDS_CONSOLE_WINDOW_HALTED"					= "URL för fönstret %s har stoppats (AllowScriptAccess är %s): %s";
"IDS_CONSOLE_ALLOW_NETWORK"					= "-- Detta beror på värdet för allowNetworking.";
"IDS_CONSOLE_NO_POLICY_FILE"				= "Det gick inte att läsa in principfilen från %s";
"IDS_CONSOLE_BAD_POLICY_FILE"				= "[strict] Principfilen på %s ignoreras på grund av felaktig syntax. Information om hur du åtgärdar det här problemet finns på http://www.adobe.com/go/strict_policy_files.";
"IDS_CONSOLE_PREFIX_OK"						= "OK: ";
"IDS_CONSOLE_PREFIX_WARNING"				= "Varning: ";
"IDS_CONSOLE_PREFIX_ERROR"					= "Fel: ";
"IDS_CONSOLE_GOOD_POLICY_FILE"				= "Godkänd principfil: %s";
"IDS_CONSOLE_BAD_POLICY_FILE_TYPE"			= "[strict] Principfilen på %s ignoreras på grund av felaktig innehållstyp (%s). Information om hur du åtgärdar det här problemet finns på http://www.adobe.com/go/strict_policy_files.";
"IDS_CONSOLE_NO_POLICY_FILE_TYPE"			= "[strict] Principfilen på %s ignoreras på grund av att en innehållstyp saknas. Information om hur du åtgärdar det här problemet finns på http://www.adobe.com/go/strict_policy_files.";
"IDS_CONSOLE_POLICY_FILE_NO_HEADERS"		= "HTTP-svarshuvud är inte tillgängliga på den här plattformen. Strikta principfilsregler kan inte verkställas.";
"IDS_CONSOLE_POLICY_FILE_REDIRECT"			= "[strict] Principfilen som har begärts från %s och som har omdirigerats till %s använder den slutliga URL:en vid bestämning av omfång. Om detta orsakar problem finns mer information på http://www.adobe.com/go/strict_policy_files.";
"IDS_CONSOLE_POLICY_FILE_CROSS_DOMAIN"		= "Principfilen som begärdes från %s ignoreras eftersom en omdirigering mellan domäner till %s utfördes.";
"IDS_CONSOLE_TOP_URL"						= "Inläst SWF på rotnivå: %s";
"IDS_CONSOLE_META_POLICY_HDR_UNKNOWN"		= "Okänd metaprincip i HTTP-huvudet från %s: %s";
"IDS_CONSOLE_META_POLICY_HDR_FTP"			= "HTTP-huvudet från %s anger metaprincipen by-ftp-filename, vilken endast kan tillämpas för FTP, inte HTTP.";
"IDS_CONSOLE_META_POLICY_HDR_CONFLICT"		= "Metaprincipkonflikt i HTTP-huvudet från %s: %s";
"IDS_CONSOLE_META_POLICY_HDR_PREV"			= "Metaprincipen %s i HTTP-huvudet från %s står i konflikt med metaprincipen %s som upprättades tidigare";
"IDS_CONSOLE_POLICY_FILE_NONE_THIS_RSP"		= "Principfilen på %s ignoreras på grund av X-Permitted-Cross-Domain-Policies: none-this-response";
"IDS_CONSOLE_POLICY_FILE_SITE_NONMASTER"	= "Taggen <site-control> i principfilen från %s ignoreras. Den här taggen är endast tillåten i huvudprincipfiler.";
"IDS_CONSOLE_META_POLICY_BAD_BY_TYPE"		= "Taggen <site-control> i principfilen från %s ignoreras. Metaprincipen by-content-type kan endast tillämpas på HTTP-platser.";
"IDS_CONSOLE_META_POLICY_BAD_BY_FTP"		= "Taggen <site-control> i principfilen från %s ignoreras. Metaprincipen by-ftp-filename kan endast tillämpas på FTP-platser.";
"IDS_CONSOLE_META_POLICY_BAD_THIS_RESPONSE"	= "Taggen <site-control> i principfilen från %s ignoreras. Metaprincipen none-this-response är endast tillåten i HTTP-svarshuvudet X-Permitted-Cross-Domain-Policies.";
"IDS_CONSOLE_META_POLICY_FILE_UNKNOWN"		= "Okänd metaprincip i principfilen från %s: %s";
"IDS_CONSOLE_META_POLICY_FILE_PREV"			= "Metaprincipen %s i principfilen från %s står i konflikt med metaprincipen %s som upprättades tidigare";
"IDS_CONSOLE_META_POLICY_DEFAULT"			= "Domänen %s anger inte en metaprincip. Standardmetaprincipen master-only tillämpas. Den här konfigurationen har tagits bort. Information om hur du åtgärdar det här problemet finns på http://www.adobe.com/go/strict_policy_files_se.";
"IDS_CONSOLE_POLICY_FILE_SOCK_NONE_NO"		= "SWF från %s kan inte ansluta till en socket i dess egen domän utan en principfil. Information om hur du åtgärdar det här problemet finns på http://www.adobe.com/go/strict_policy_files.";
"IDS_CONSOLE_POLICY_FILE_SOCK_TIMEOUT"		= "Timeout på %s (efter 3 sekunder) i väntan på socketprincipfilen. Detta bör inte orsaka några problem, men en förklaring ges på http://www.adobe.com/go/strict_policy_files.";
"IDS_CONSOLE_META_POLICY_IMPLICIT"			= "Domänen %s anger inte explicit en metaprincip, men innehållstypen för principfilen %s är text/x-cross-domain-policy. Metaprincipen by-content-type tillämpas.";
"IDS_CONSOLE_META_POLICY_REJECT"			= "Principfilen på %s ignoreras på grund av metaprincipen %s.";
"IDS_CONSOLE_POLICY_FILE_TOO_BIG"			= "Socketprincipfilen på %s ignoreras på grund av att den är för stor. Socketprincipfiler får inte överskrida 20 kB.";
"IDS_CONSOLE_MASTER_SELF_INVALIDATED"		= "<allow-access-from>-direktiven för principfilen på %s är ogiltiga eftersom filen deklarerar metaprincipen none.";
"IDS_CONSOLE_POLICY_FILE_BAD_PORT_SPEC"		= "Det ogiltiga portnumret %s som har angetts i principfilen på %s ignoreras";
"IDS_CONSOLE_POLICY_FILE_BAD_ALLOW"			= "Den ogiltiga taggen <%s> för domänen %s i principfilen på %s ignoreras";
"IDS_CONSOLE_REQUEST_ALLOWED_BY_POLICY"		= "Resursbegäran %s av den som gjorde begäran från %s är tillåten på grund av principfilen på %s";
"IDS_CONSOLE_REQUEST_DENIED_NO_POLICY"		= "Resursbegäran på %s av den som gjorde begäran från %s nekas på grund av att principfilsbehörighet saknas.";
"IDS_CONSOLE_SOCKET_UNAVAILABLE"			= "Resursbegäran på %s av den som gjorde begäran från %s misslyckades eftersom servern inte kan nås.";
"IDS_CONSOLE_NO_ASFUNCTION"					= "Avslår URL:en %s eftersom protokollet asfunction: endast får användas för länkmål, inte för nätverks-API:n.";
"IDS_CONSOLE_POLICY_BAD_SECURE_ATTR"		= "Attributet secure i principfilen från %s ignoreras. Attributet secure är endast tillåtet i HTTPS- och socketprincipfiler. Mer information finns på http://www.adobe.com/go/strict_policy_files.";
"IDS_CONSOLE_POLICY_SOCK_SECURE_ATTR"		= "Hittade secure=\'true\' i principfilen från %s, men värden %s verkar inte referera till den lokala datorn. Detta kan vara osäkert. Mer information finns på http://www.adobe.com/go/strict_policy_files.";
"IDS_CONSOLE_POLICY_REASON_DATA"			= "Söker efter <allow-access-from> i principfiler för att godkänna inläsning av data från resursen %s av den som gjorde begäran från %s";
"IDS_CONSOLE_POLICY_REASON_HEADERS"			= "Söker efter <allow-http-request-headers-from> i principfiler för att godkänna huvud som skickas till URL:en %s av den som gjorde begäran från %s";
"IDS_CONSOLE_QUESTIONABLE_SCRIPTING"		= "-- Webbskript-URLer kan endast köras med funktionerna getURL och navigateToURL.";
"IDS_CONSOLE_WARN_ALLOW_NEVER"				= "Varning: AllowScriptAccess=never hittades i HTML. Den här inställningen är ogiltig och har tagits bort. Mer information finns på http://www.adobe.com/go/allowscriptaccess_se.";
"IDS_CONSOLE_WARN_ALLOW_SAMEDOM"			= "Varning: AllowNetworking=%s hittades i HTML, och HTML och SWF fanns i samma domän. Den här inställningen är ogiltig och har tagits bort. Mer information finns på http://www.adobe.com/go/allowscriptaccess_se.";
"IDS_CONSOLE_WARN_3D_SURFACE_TOO_BIG"		= "Varning: 3D DisplayObject återges inte.  Måtten (%s, %s) är för stora för att ritas.";
"IDS_CONSOLE_WARN_FILTER_TOO_BIG"			= "Varning: Filtret återges inte.  De filtrerade måtten för DisplayObject (%s, %s) är för stora för att ritas.";
"IDS_CONSOLE_FORCE_DOWNLOAD_WAS_SET"		= "Försöket att läsa in %s misslyckades eftersom den hade en Content-Disposition för attachment angiven.";
"IDS_CONSOLE_USER_ACTION_REQUIRED"			= "Vissa åtgärder, till exempel sådana som visar ett popup-fönster kan utlösas genom användarinteraktion, till exempel genom att användaren klickar med musen eller klickar på en knapp.";
"IDS_LOCALCONNECTION_USERSCOPED_LOCKED"     = "Värdet LocalConnection.isPerUser kan inte ändras eftersom det redan spärrats av ett anrop till LocalConnection.connect, .send eller .close.";
"IDS_CONSOLE_POLICY_FILE_BAD_PF_URL"		= "Ignorerar regelfil med ogiltig icke-ASCII URL %s";
"IDS_CONSOLE_POLICY_FILE_BAD_DATA_URL"		= "Kan inte auktorisera åtgärd för ogiltig icke-ASCII URL %s";
